Forkfull/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "P4RImA9n75bCvw7SI0Jqqg=="], ["updated_at", "2021-02-09 19:53:25.229132"], ["id", 1]]